from flask import Flask
from flask_sqlalchemy import SQLAlchemy
from flask_caching import Cache

config = {
    "DEBUG": True,          # some Flask specific configs
    "CACHE_TYPE": "SimpleCache",  # Flask-Caching related configs
    "CACHE_DEFAULT_TIMEOUT": 300,
    "SQLALCHEMY_TRACK_MODIFICATIONS": False
}
app = Flask(__name__)
app.secret_key = b'_5#y2L"F4Q8z\n\xec]/'
app.config['SQLALCHEMY_DATABASE_URI'] = 'sqlite:///sqlite.db'
db = SQLAlchemy(app)
app.config.from_mapping(config)
cache = Cache(app)

quizes = {"rusb":{
    "questions" : {
  "В каком году умер Иван Грозный ?: ": "1584",
  "В Угличе, в 1591 году погиб царевич?: ": "Дмитрий",
  "В 1605 году на престол вступил?: ": "Лжедмитрий I",
  "Как звали жену Лжедмитриев ?: ": "Марина Мнишек",
  "Тушинский вор ?: ": "Лжедмитрий II",
    },
  "options" : [["1598", "1584", "1581", "1579"],
            ["Федор", "Иван", "Дмитрий", "Петр"],
            ["Василий Шуйский", "Болотников", "Лжедмитрий II", "Лжедмитрий I"],
            ["Марина Мнишек", "Марфа Борецкая", "Елезовета II", "Елизаветна Романова"],
            ["Шуйский", "Базаров", "Годунов", "Лжедмитрий II"],
            ]


},
"rusb_sec":{
  "questions" : {
      "В 1237-1480 гг. Русь находилась в зависимости от?: ": "Золотой орды",
      "Первая российская революция произошла в ?: ": "1905-1907 годах",
      "В 988 году великий князь Владимир в качестве государственной религии принял:?: ": "Христьянство",
      "В IХ-ХIII веках столицей Древнерусского государства был город?: ": "Киев",
      "Первый патриарх на руси?: ": "Иов",
    },
  "options" : [["Шведов", "Ливонского ордена", "Поляков", "Золотой орды"],
        ["1853-1856 годах","1905-1907 годах", "1918-1921 годах", "1914-1917годах"],
        ["Христьянство","Ислам", "Иуддаизм", "Атеизм"],
        ["Киев", "Москва", "Питер", "Махачкала"],
        ["Алий","Иов", "Ибрагим", "Изобар"],
  ]
}
}

descriptions = {
  "rusb":"",
  "rusb_sec":""
}
