
quizes = {"rusb":{
    "questions" : {
  "В каком году умер Иван Грозный ?: ": "1584",
  "В Угличе, в 1591 году погиб царевич?: ": "Дмитрий",
  "В 1605 году на престол вступил?: ": "Лжедмитрий I",
  "Как звали жену Лжедмитриев ?: ": "Марина Мнишек",
  "Тушинский вор ?: ": "Лжедмитрий II",
    },
  "options" : [["1598", "1584", "1581", "1579"],
            ["Федор", "Иван", "Дмитрий", "Петр"],
            ["Василий Шуйский", "Болотников", "Лжедмитрий II", "Лжедмитрий I"],
            ["Марина Мнишек", "Марфа Борецкая", "Елезовета II", "Елизаветна Романова"],
            ["Шуйский", "Базаров", "Годунов", "Лжедмитрий II"],
            ]


},
"rusb_sec":{
  "questions" : {
      "В 1237-1480 гг. Русь находилась в зависимости от?: ": "Золотой орды",
      "Первая российская революция произошла в ?: ": "1905-1907 годах",
      "В 988 году великий князь Владимир в качестве государственной религии принял:?: ": "Христьянство",
      "В IХ-ХIII веках столицей Древнерусского государства был город?: ": "Киев",
      "Первый патриарх на руси?: ": "Иов",
    },
  "options" : [["Шведов", "Ливонского ордена", "Поляков", "Золотой орды"],
        ["1853-1856 годах","1905-1907 годах", "1918-1921 годах", "1914-1917годах"],
        ["Христьянство","Ислам", "Иуддаизм", "Атеизм"],
        ["Киев", "Москва", "Питер", "Махачкала"],
        ["Алий","Иов", "Ибрагим", "Изобар"],
  ]
}
}
victs = {"russian_high_tier_politics7aha":{
    "questions" : {
  "НОВИЧОК))) В ЭТом деле?) ": "0 5 20",
  "Вы умерали недвано?: ": "10 0 0 0",
  "Желто синий самый?: ": "10 10 0 20",
  "собак любите?: ": "0 5 15",
  "Тушинский вор ?: ": "5 10 15 20",
    },
  "options" : [["Нет", "Что?", "ХАХАХАХ ДАДА)"],
            ["Да", "Нет", "ФЯячс", "Петр"],
            ["сильный", "Хохлы? хахаха", "Что?", "Спартак"],
            ["да", "зачем", "нет"],
            ],
  "variants": {
    "максим кац": 20,
    "жириновский": 40,
    "навальный": 60,
  }

},
"vict2":{}
}

descriptions = {
  "rusb":"",
  "rusb_sec":""
}